codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx151f128e.h
extern volatile __REFCON1Bbits_t REFCON1Bbits __asm__ ("REFCON1B") __attribute__((section("sfrs")));
extern volatile unsigned int        REFCON1BCLR __attribute__((section("sfrs")));
extern volatile unsigned int        REFCON1BSET __attribute__((section("sfrs")));
extern volatile unsigned int        REFCON1BINV __attribute__((section("sfrs")));
extern volatile unsigned int        CVDTXEN0S __attribute__((section("sfrs")));
typedef struct {
  unsigned :16;
  unsigned TX0_0:1;
  unsigned TX1_0:1;
  unsigned TX2_0:1;
  unsigned TX3_0:1;
  unsigned TX4_0:1;
  unsigned TX0_1:1;
  unsigned TX1_1:1;
  unsigned TX2_1:1;
  unsigned TX3_1:1;
  unsigned TX4_1:1;
  unsigned TX0_2:1;
  unsigned TX1_2:1;
  unsigned TX2_2:1;
  unsigned TX3_2:1;
  unsigned TX4_2:1;
  unsigned TX0_3:1;
} __CVDTXEN0Sbits_t;
extern volatile __CVDTXEN0Sbits_t CVDTXEN0Sbits __asm__ ("CVDTXEN0S") __attribute__((section("sfrs")));
extern volatile unsigned int        CVDTXEN0SCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CVDTXEN0SSET __attribute__((section("sfrs")));
extern volatile unsigned int        CVDTXEN0SINV __attribute__((section("sfrs")));
extern volatile unsigned int        CVDTXEN1S __attribute__((section("sfrs")));
typedef struct {
  unsigned TX1_3:1;
  unsigned TX2_3:1;
  unsigned TX3_3:1;
  unsigned TX4_3:1;
  unsigned TX0_4:1;
  unsigned TX1_4:1;
  unsigned TX2_4:1;
  unsigned TX3_4:1;
  unsigned TX4_4:1;
  unsigned TX0_5:1;
  unsigned TX1_5:1;
  unsigned TX2_5:1;
  unsigned TX3_5:1;
  unsigned TX4_5:1;
  unsigned TX0_6:1;
  unsigned TX1_6:1;
  unsigned TX2_6:1;
  unsigned TX3_6:1;
  unsigned TX4_6:1;
  unsigned TX0_7:1;
  unsigned TX1_7:1;
  unsigned TX2_7:1;
  unsigned TX3_7:1;
  unsigned TX4_7:1;
  unsigned TX0_8:1;
  unsigned TX1_8:1;
  unsigned TX2_8:1;
  unsigned TX3_8:1;
  unsigned TX4_8:1;
  unsigned TX0_9:1;
  unsigned TX1_9:1;
  unsigned TX2_9:1;
} __CVDTXEN1Sbits_t;
extern volatile __CVDTXEN1Sbits_t CVDTXEN1Sbits __asm__ ("CVDTXEN1S") __attribute__((section("sfrs")));
extern volatile unsigned int        CVDTXEN1SCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CVDTXEN1SSET __attribute__((section("sfrs")));
extern volatile unsigned int        CVDTXEN1SINV __attribute__((section("sfrs")));
extern volatile unsigned int        CVDRXEN0S __attribute__((section("sfrs")));
typedef struct {
  unsigned RX0_0:1;
  unsigned RX1_0:1;
  unsigned RX2_0:1;
  unsigned RX3_0:1;
  unsigned RX4_0:1;
  unsigned RX0_1:1;
  unsigned RX1_1:1;
  unsigned RX2_1:1;
  unsigned RX3_1:1;
  unsigned RX4_1:1;
  unsigned RX0_2:1;
  unsigned RX1_2:1;
  unsigned RX2_2:1;
  unsigned RX3_2:1;
  unsigned RX4_2:1;
  unsigned RX0_3:1;
  unsigned RX1_3:1;
  unsigned RX2_3:1;
  unsigned RX3_3:1;
  unsigned RX4_3:1;
  unsigned RX0_4:1;
  unsigned RX1_4:1;
  unsigned RX2_4:1;
  unsigned RX3_4:1;
  unsigned RX4_4:1;
  unsigned RX0_5:1;
  unsigned RX1_5:1;
  unsigned RX2_5:1;
  unsigned RX3_5:1;
  unsigned RX4_5:1;
  unsigned RX0_6:1;
  unsigned RX1_6:1;
} __CVDRXEN0Sbits_t;
extern volatile __CVDRXEN0Sbits_t CVDRXEN0Sbits __asm__ ("CVDRXEN0S") __attribute__((section("sfrs")));
extern volatile unsigned int        CVDRXEN0SCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CVDRXEN0SSET __attribute__((section("sfrs")));
extern volatile unsigned int        CVDRXEN0SINV __attribute__((section("sfrs")));
extern volatile unsigned int        CVDRXEN1S __attribute__((section("sfrs")));
typedef struct {
  unsigned RX2_6:1;
  unsigned RX3_6:1;
  unsigned RX4_6:1;
  unsigned RX0_7:1;
  unsigned RX1_7:1;
  unsigned RX2_7:1;
  unsigned RX3_7:1;
  unsigned RX4_7:1;
  unsigned RX0_8:1;
  unsigned RX1_8:1;
  unsigned RX2_8:1;
  unsigned RX3_8:1;
  unsigned RX4_8:1;
  unsigned RX0_9:1;
  unsigned RX1_9:1;
  unsigned RX2_9:1;
  unsigned RX3_9:1;
  unsigned RX4_9:1;
  unsigned RX0_10:1;
  unsigned RX1_10:1;
  unsigned RX2_10:1;
  unsigned RX3_10:1;
  unsigned RX4_10:1;
} __CVDRXEN1Sbits_t;
extern volatile __CVDRXEN1Sbits_t CVDRXEN1Sbits __asm__ ("CVDRXEN1S") __attribute__((section("sfrs")));
extern volatile unsigned int        CVDRXEN1SCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CVDRXEN1SSET __attribute__((section("sfrs")));
extern volatile unsigned int        CVDRXEN1SINV __attribute__((section("sfrs")));
extern volatile unsigned int        REFCON0S __attribute__((section("sfrs")));
typedef struct {
  unsigned REFCON0:8;
  unsigned REFCON1:8;
  unsigned REFCON2:8;
  unsigned REFGAIN3:8;
} __REFCON0Sbits_t;
extern volatile __REFCON0Sbits_t REFCON0Sbits __asm__ ("REFCON0S") __attribute__((section("sfrs")));
extern volatile unsigned int        REFCON0SCLR __attribute__((section("sfrs")));
extern volatile unsigned int        REFCON0SSET __attribute__((section("sfrs")));
extern volatile unsigned int        REFCON0SINV __attribute__((section("sfrs")));
extern volatile unsigned int        REFCON1S __attribute__((section("sfrs")));
typedef struct {
  unsigned REFGAIN4:8;
} __REFCON1Sbits_t;
extern volatile __REFCON1Sbits_t REFCON1Sbits __asm__ ("REFCON1S") __attribute__((section("sfrs")));
extern volatile unsigned int        REFCON1SCLR __attribute__((section("sfrs")));
extern volatile unsigned int        REFCON1SSET __attribute__((section("sfrs")));
extern volatile unsigned int        REFCON1SINV __attribute__((section("sfrs")));
extern volatile unsigned int        AFEDATA __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AFEDATAbits_t;
extern volatile __AFEDATAbits_t AFEDATAbits __asm__ ("AFEDATA") __attribute__((section("sfrs")));
extern volatile unsigned int        AFEDATACLR __attribute__((section("sfrs")));
extern volatile unsigned int        AFEDATASET __attribute__((section("sfrs")));
extern volatile unsigned int        AFEDATAINV __attribute__((section("sfrs")));
extern volatile unsigned int        UDCON __attribute__((section("sfrs")));
typedef struct {
  unsigned TX0EN:1;
  unsigned TX1EN:1;
  unsigned :1;
  unsigned RX0EN:1;
  unsigned RX1EN:1;
  unsigned :1;
  unsigned REF0EN:1;
  unsigned REF1EN:1;
  unsigned TARGIDX:3;
  unsigned CLRCNT:1;
  unsigned CHCONIDX:3;
  unsigned CHDMA:1;
  unsigned LEN:8;
  unsigned COUNT:8;
} __UDCONbits_t;
