codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx151f128e.h
#define _AD0CON1_SAMP_POSITION                   0x00000001
#define _AD0CON1_SAMP_MASK                       0x00000002
#define _AD0CON1_SAMP_LENGTH                     0x00000001

#define _AD0CON1_ASAM_POSITION                   0x00000002
#define _AD0CON1_ASAM_MASK                       0x0000000C
#define _AD0CON1_ASAM_LENGTH                     0x00000002

#define _AD0CON1_CLR_ASAM_POSITION               0x00000004
#define _AD0CON1_CLR_ASAM_MASK                   0x00000010
#define _AD0CON1_CLR_ASAM_LENGTH                 0x00000001

#define _AD0CON1_SSRC_POSITION                   0x00000005
#define _AD0CON1_SSRC_MASK                       0x000000E0
#define _AD0CON1_SSRC_LENGTH                     0x00000003

#define _AD0CON1_EN_POSITION                     0x0000000F
#define _AD0CON1_EN_MASK                         0x00008000
#define _AD0CON1_EN_LENGTH                       0x00000001

#define _AD0CON1_SAMC_POSITION                   0x00000010
#define _AD0CON1_SAMC_MASK                       0x001F0000
#define _AD0CON1_SAMC_LENGTH                     0x00000005

#define _AD0CON1_SAMCV_POSITION                  0x00000018
#define _AD0CON1_SAMCV_MASK                      0x1F000000
#define _AD0CON1_SAMCV_LENGTH                    0x00000005

#define _AD1CON1_DONE_POSITION                   0x00000000
#define _AD1CON1_DONE_MASK                       0x00000001
#define _AD1CON1_DONE_LENGTH                     0x00000001

#define _AD1CON1_SAMP_POSITION                   0x00000001
#define _AD1CON1_SAMP_MASK                       0x00000002
#define _AD1CON1_SAMP_LENGTH                     0x00000001

#define _AD1CON1_ASAM_POSITION                   0x00000002
#define _AD1CON1_ASAM_MASK                       0x0000000C
#define _AD1CON1_ASAM_LENGTH                     0x00000002

#define _AD1CON1_CLR_ASAM_POSITION               0x00000004
#define _AD1CON1_CLR_ASAM_MASK                   0x00000010
#define _AD1CON1_CLR_ASAM_LENGTH                 0x00000001

#define _AD1CON1_SSRC_POSITION                   0x00000005
#define _AD1CON1_SSRC_MASK                       0x000000E0
#define _AD1CON1_SSRC_LENGTH                     0x00000003

#define _AD1CON1_EN_POSITION                     0x0000000F
#define _AD1CON1_EN_MASK                         0x00008000
#define _AD1CON1_EN_LENGTH                       0x00000001

#define _AD1CON1_SAMC_POSITION                   0x00000010
#define _AD1CON1_SAMC_MASK                       0x001F0000
#define _AD1CON1_SAMC_LENGTH                     0x00000005

#define _AD1CON1_SAMCV_POSITION                  0x00000018
#define _AD1CON1_SAMCV_MASK                      0x1F000000
#define _AD1CON1_SAMCV_LENGTH                    0x00000005

#define _AD2CON1_DONE_POSITION                   0x00000000
#define _AD2CON1_DONE_MASK                       0x00000001
#define _AD2CON1_DONE_LENGTH                     0x00000001

#define _AD2CON1_SAMP_POSITION                   0x00000001
#define _AD2CON1_SAMP_MASK                       0x00000002
#define _AD2CON1_SAMP_LENGTH                     0x00000001

#define _AD2CON1_ASAM_POSITION                   0x00000002
#define _AD2CON1_ASAM_MASK                       0x0000000C
#define _AD2CON1_ASAM_LENGTH                     0x00000002

#define _AD2CON1_CLR_ASAM_POSITION               0x00000004
#define _AD2CON1_CLR_ASAM_MASK                   0x00000010
#define _AD2CON1_CLR_ASAM_LENGTH                 0x00000001

#define _AD2CON1_SSRC_POSITION                   0x00000005
#define _AD2CON1_SSRC_MASK                       0x000000E0
#define _AD2CON1_SSRC_LENGTH                     0x00000003

#define _AD2CON1_EN_POSITION                     0x0000000F
#define _AD2CON1_EN_MASK                         0x00008000
#define _AD2CON1_EN_LENGTH                       0x00000001

#define _AD2CON1_SAMC_POSITION                   0x00000010
#define _AD2CON1_SAMC_MASK                       0x001F0000
#define _AD2CON1_SAMC_LENGTH                     0x00000005

#define _AD2CON1_SAMCV_POSITION                  0x00000018
#define _AD2CON1_SAMCV_MASK                      0x1F000000
#define _AD2CON1_SAMCV_LENGTH                    0x00000005

#define _AD3CON1_DONE_POSITION                   0x00000000
#define _AD3CON1_DONE_MASK                       0x00000001
#define _AD3CON1_DONE_LENGTH                     0x00000001

#define _AD3CON1_SAMP_POSITION                   0x00000001
#define _AD3CON1_SAMP_MASK                       0x00000002
#define _AD3CON1_SAMP_LENGTH                     0x00000001

#define _AD3CON1_ASAM_POSITION                   0x00000002
#define _AD3CON1_ASAM_MASK                       0x0000000C
#define _AD3CON1_ASAM_LENGTH                     0x00000002

#define _AD3CON1_CLR_ASAM_POSITION               0x00000004
#define _AD3CON1_CLR_ASAM_MASK                   0x00000010
#define _AD3CON1_CLR_ASAM_LENGTH                 0x00000001

#define _AD3CON1_SSRC_POSITION                   0x00000005
#define _AD3CON1_SSRC_MASK                       0x000000E0
#define _AD3CON1_SSRC_LENGTH                     0x00000003

#define _AD3CON1_EN_POSITION                     0x0000000F
#define _AD3CON1_EN_MASK                         0x00008000
#define _AD3CON1_EN_LENGTH                       0x00000001

#define _AD3CON1_SAMC_POSITION                   0x00000010
#define _AD3CON1_SAMC_MASK                       0x001F0000
#define _AD3CON1_SAMC_LENGTH                     0x00000005

#define _AD3CON1_SAMCV_POSITION                  0x00000018
#define _AD3CON1_SAMCV_MASK                      0x1F000000
#define _AD3CON1_SAMCV_LENGTH                    0x00000005

#define _AD4CON1_DONE_POSITION                   0x00000000
#define _AD4CON1_DONE_MASK                       0x00000001
#define _AD4CON1_DONE_LENGTH                     0x00000001

#define _AD4CON1_SAMP_POSITION                   0x00000001
#define _AD4CON1_SAMP_MASK                       0x00000002
#define _AD4CON1_SAMP_LENGTH                     0x00000001

#define _AD4CON1_ASAM_POSITION                   0x00000002
#define _AD4CON1_ASAM_MASK                       0x0000000C
#define _AD4CON1_ASAM_LENGTH                     0x00000002

#define _AD4CON1_CLR_ASAM_POSITION               0x00000004
#define _AD4CON1_CLR_ASAM_MASK                   0x00000010
#define _AD4CON1_CLR_ASAM_LENGTH                 0x00000001

#define _AD4CON1_SSRC_POSITION                   0x00000005
#define _AD4CON1_SSRC_MASK                       0x000000E0
#define _AD4CON1_SSRC_LENGTH                     0x00000003

#define _AD4CON1_EN_POSITION                     0x0000000F
#define _AD4CON1_EN_MASK                         0x00008000
#define _AD4CON1_EN_LENGTH                       0x00000001

#define _AD4CON1_SAMC_POSITION                   0x00000010
#define _AD4CON1_SAMC_MASK                       0x001F0000
#define _AD4CON1_SAMC_LENGTH                     0x00000005

