codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx151f128e.h
#define _CICSTAT_DONE_POSITION                   0x00000010
#define _CICSTAT_DONE_MASK                       0x00010000
#define _CICSTAT_DONE_LENGTH                     0x00000001

#define _CICSTAT_BUSY_POSITION                   0x00000011
#define _CICSTAT_BUSY_MASK                       0x00020000
#define _CICSTAT_BUSY_LENGTH                     0x00000001

#define _CICSTAT_POLARITY_POSITION               0x00000012
#define _CICSTAT_POLARITY_MASK                   0x00040000
#define _CICSTAT_POLARITY_LENGTH                 0x00000001

#define _CICSTAT_CURLEN_POSITION                 0x00000013
#define _CICSTAT_CURLEN_MASK                     0x00080000
#define _CICSTAT_CURLEN_LENGTH                   0x00000001

#define _CICSTAT_DMAFISCH_POSITION               0x00000014
#define _CICSTAT_DMAFISCH_MASK                   0x00700000
#define _CICSTAT_DMAFISCH_LENGTH                 0x00000003

#define _CICSTAT_DMAOUTCH_POSITION               0x00000018
#define _CICSTAT_DMAOUTCH_MASK                   0x07000000
#define _CICSTAT_DMAOUTCH_LENGTH                 0x00000003

#define _CICSTAT_DMAINCH_POSITION                0x0000001C
#define _CICSTAT_DMAINCH_MASK                    0x70000000
#define _CICSTAT_DMAINCH_LENGTH                  0x00000003

#define _FISSTAT0_LFIS0_POSITION                 0x00000000
#define _FISSTAT0_LFIS0_MASK                     0x00000FFF
#define _FISSTAT0_LFIS0_LENGTH                   0x0000000C

#define _FISSTAT0_HFIS0_POSITION                 0x00000010
#define _FISSTAT0_HFIS0_MASK                     0x0FFF0000
#define _FISSTAT0_HFIS0_LENGTH                   0x0000000C

#define _FISSTAT1_LFIS1_POSITION                 0x00000000
#define _FISSTAT1_LFIS1_MASK                     0x00000FFF
#define _FISSTAT1_LFIS1_LENGTH                   0x0000000C

#define _FISSTAT1_HFIS1_POSITION                 0x00000010
#define _FISSTAT1_HFIS1_MASK                     0x0FFF0000
#define _FISSTAT1_HFIS1_LENGTH                   0x0000000C

#define _FISSTAT2_LFIS2_POSITION                 0x00000000
#define _FISSTAT2_LFIS2_MASK                     0x00000FFF
#define _FISSTAT2_LFIS2_LENGTH                   0x0000000C

#define _FISSTAT2_HFIS2_POSITION                 0x00000010
#define _FISSTAT2_HFIS2_MASK                     0x0FFF0000
#define _FISSTAT2_HFIS2_LENGTH                   0x0000000C

#define _FISSTAT3_LFIS3_POSITION                 0x00000000
#define _FISSTAT3_LFIS3_MASK                     0x00000FFF
#define _FISSTAT3_LFIS3_LENGTH                   0x0000000C

#define _FISSTAT3_HFIS3_POSITION                 0x00000010
#define _FISSTAT3_HFIS3_MASK                     0x0FFF0000
#define _FISSTAT3_HFIS3_LENGTH                   0x0000000C

#define _FISSTAT4_LFIS4_POSITION                 0x00000000
#define _FISSTAT4_LFIS4_MASK                     0x00000FFF
#define _FISSTAT4_LFIS4_LENGTH                   0x0000000C

#define _FISSTAT4_HFIS4_POSITION                 0x00000010
#define _FISSTAT4_HFIS4_MASK                     0x0FFF0000
#define _FISSTAT4_HFIS4_LENGTH                   0x0000000C

#define _CICOUT0_CICCOUNT0_POSITION              0x00000000
#define _CICOUT0_CICCOUNT0_MASK                  0xFFFFFFFF
#define _CICOUT0_CICCOUNT0_LENGTH                0x00000020

#define _CICOUT1_CICCOUNT1_POSITION              0x00000000
#define _CICOUT1_CICCOUNT1_MASK                  0xFFFFFFFF
#define _CICOUT1_CICCOUNT1_LENGTH                0x00000020

#define _CICOUT2_CICCOUNT2_POSITION              0x00000000
#define _CICOUT2_CICCOUNT2_MASK                  0xFFFFFFFF
#define _CICOUT2_CICCOUNT2_LENGTH                0x00000020

#define _CICOUT3_CICCOUNT3_POSITION              0x00000000
#define _CICOUT3_CICCOUNT3_MASK                  0xFFFFFFFF
#define _CICOUT3_CICCOUNT3_LENGTH                0x00000020

#define _CICOUT4_CICCOUNT4_POSITION              0x00000000
#define _CICOUT4_CICCOUNT4_MASK                  0xFFFFFFFF
#define _CICOUT4_CICCOUNT4_LENGTH                0x00000020

#define _OSCCON_OSWEN_POSITION                   0x00000000
#define _OSCCON_OSWEN_MASK                       0x00000001
#define _OSCCON_OSWEN_LENGTH                     0x00000001

#define _OSCCON_SOSCEN_POSITION                  0x00000001
#define _OSCCON_SOSCEN_MASK                      0x00000002
#define _OSCCON_SOSCEN_LENGTH                    0x00000001

#define _OSCCON_UFRCEN_POSITION                  0x00000002
#define _OSCCON_UFRCEN_MASK                      0x00000004
#define _OSCCON_UFRCEN_LENGTH                    0x00000001

#define _OSCCON_CF_POSITION                      0x00000003
#define _OSCCON_CF_MASK                          0x00000008
#define _OSCCON_CF_LENGTH                        0x00000001

#define _OSCCON_SLPEN_POSITION                   0x00000004
#define _OSCCON_SLPEN_MASK                       0x00000010
#define _OSCCON_SLPEN_LENGTH                     0x00000001

#define _OSCCON_SLOCK_POSITION                   0x00000005
#define _OSCCON_SLOCK_MASK                       0x00000020
#define _OSCCON_SLOCK_LENGTH                     0x00000001

#define _OSCCON_ULOCK_POSITION                   0x00000006
#define _OSCCON_ULOCK_MASK                       0x00000040
#define _OSCCON_ULOCK_LENGTH                     0x00000001

#define _OSCCON_CLKLOCK_POSITION                 0x00000007
#define _OSCCON_CLKLOCK_MASK                     0x00000080
#define _OSCCON_CLKLOCK_LENGTH                   0x00000001

#define _OSCCON_NOSC_POSITION                    0x00000008
#define _OSCCON_NOSC_MASK                        0x00000700
#define _OSCCON_NOSC_LENGTH                      0x00000003

#define _OSCCON_COSC_POSITION                    0x0000000C
#define _OSCCON_COSC_MASK                        0x00007000
#define _OSCCON_COSC_LENGTH                      0x00000003

#define _OSCCON_PLLMULT_POSITION                 0x00000010
#define _OSCCON_PLLMULT_MASK                     0x00070000
#define _OSCCON_PLLMULT_LENGTH                   0x00000003

#define _OSCCON_PBDIV_POSITION                   0x00000013
#define _OSCCON_PBDIV_MASK                       0x00180000
#define _OSCCON_PBDIV_LENGTH                     0x00000002

#define _OSCCON_PBDIVRDY_POSITION                0x00000015
#define _OSCCON_PBDIVRDY_MASK                    0x00200000
#define _OSCCON_PBDIVRDY_LENGTH                  0x00000001

