codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx151f128e.h
#define _LATC_LATC3_POSITION                     0x00000003
#define _LATC_LATC3_MASK                         0x00000008
#define _LATC_LATC3_LENGTH                       0x00000001

#define _LATC_LATC4_POSITION                     0x00000004
#define _LATC_LATC4_MASK                         0x00000010
#define _LATC_LATC4_LENGTH                       0x00000001

#define _LATC_LATC5_POSITION                     0x00000005
#define _LATC_LATC5_MASK                         0x00000020
#define _LATC_LATC5_LENGTH                       0x00000001

#define _LATC_LATC6_POSITION                     0x00000006
#define _LATC_LATC6_MASK                         0x00000040
#define _LATC_LATC6_LENGTH                       0x00000001

#define _LATC_LATC7_POSITION                     0x00000007
#define _LATC_LATC7_MASK                         0x00000080
#define _LATC_LATC7_LENGTH                       0x00000001

#define _LATC_LATC8_POSITION                     0x00000008
#define _LATC_LATC8_MASK                         0x00000100
#define _LATC_LATC8_LENGTH                       0x00000001

#define _LATC_LATC9_POSITION                     0x00000009
#define _LATC_LATC9_MASK                         0x00000200
#define _LATC_LATC9_LENGTH                       0x00000001

#define _LATC_w_POSITION                         0x00000000
#define _LATC_w_MASK                             0xFFFFFFFF
#define _LATC_w_LENGTH                           0x00000020

#define _ODCC_ODCC4_POSITION                     0x00000004
#define _ODCC_ODCC4_MASK                         0x00000010
#define _ODCC_ODCC4_LENGTH                       0x00000001

#define _ODCC_ODCC5_POSITION                     0x00000005
#define _ODCC_ODCC5_MASK                         0x00000020
#define _ODCC_ODCC5_LENGTH                       0x00000001

#define _ODCC_ODCC6_POSITION                     0x00000006
#define _ODCC_ODCC6_MASK                         0x00000040
#define _ODCC_ODCC6_LENGTH                       0x00000001

#define _ODCC_ODCC7_POSITION                     0x00000007
#define _ODCC_ODCC7_MASK                         0x00000080
#define _ODCC_ODCC7_LENGTH                       0x00000001

#define _ODCC_ODCC8_POSITION                     0x00000008
#define _ODCC_ODCC8_MASK                         0x00000100
#define _ODCC_ODCC8_LENGTH                       0x00000001

#define _ODCC_ODCC9_POSITION                     0x00000009
#define _ODCC_ODCC9_MASK                         0x00000200
#define _ODCC_ODCC9_LENGTH                       0x00000001

#define _ODCC_w_POSITION                         0x00000000
#define _ODCC_w_MASK                             0xFFFFFFFF
#define _ODCC_w_LENGTH                           0x00000020

#define _IOCPUC_IOCPUC0_POSITION                 0x00000000
#define _IOCPUC_IOCPUC0_MASK                     0x00000001
#define _IOCPUC_IOCPUC0_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC1_POSITION                 0x00000001
#define _IOCPUC_IOCPUC1_MASK                     0x00000002
#define _IOCPUC_IOCPUC1_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC2_POSITION                 0x00000002
#define _IOCPUC_IOCPUC2_MASK                     0x00000004
#define _IOCPUC_IOCPUC2_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC3_POSITION                 0x00000003
#define _IOCPUC_IOCPUC3_MASK                     0x00000008
#define _IOCPUC_IOCPUC3_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC4_POSITION                 0x00000004
#define _IOCPUC_IOCPUC4_MASK                     0x00000010
#define _IOCPUC_IOCPUC4_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC5_POSITION                 0x00000005
#define _IOCPUC_IOCPUC5_MASK                     0x00000020
#define _IOCPUC_IOCPUC5_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC6_POSITION                 0x00000006
#define _IOCPUC_IOCPUC6_MASK                     0x00000040
#define _IOCPUC_IOCPUC6_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC7_POSITION                 0x00000007
#define _IOCPUC_IOCPUC7_MASK                     0x00000080
#define _IOCPUC_IOCPUC7_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC8_POSITION                 0x00000008
#define _IOCPUC_IOCPUC8_MASK                     0x00000100
#define _IOCPUC_IOCPUC8_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC9_POSITION                 0x00000009
#define _IOCPUC_IOCPUC9_MASK                     0x00000200
#define _IOCPUC_IOCPUC9_LENGTH                   0x00000001

#define _IOCPUC_w_POSITION                       0x00000000
#define _IOCPUC_w_MASK                           0xFFFFFFFF
#define _IOCPUC_w_LENGTH                         0x00000020

#define _IOCPDC_IOCPDC0_POSITION                 0x00000000
#define _IOCPDC_IOCPDC0_MASK                     0x00000001
#define _IOCPDC_IOCPDC0_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC1_POSITION                 0x00000001
#define _IOCPDC_IOCPDC1_MASK                     0x00000002
#define _IOCPDC_IOCPDC1_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC2_POSITION                 0x00000002
#define _IOCPDC_IOCPDC2_MASK                     0x00000004
#define _IOCPDC_IOCPDC2_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC3_POSITION                 0x00000003
#define _IOCPDC_IOCPDC3_MASK                     0x00000008
#define _IOCPDC_IOCPDC3_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC4_POSITION                 0x00000004
#define _IOCPDC_IOCPDC4_MASK                     0x00000010
#define _IOCPDC_IOCPDC4_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC5_POSITION                 0x00000005
#define _IOCPDC_IOCPDC5_MASK                     0x00000020
#define _IOCPDC_IOCPDC5_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC6_POSITION                 0x00000006
#define _IOCPDC_IOCPDC6_MASK                     0x00000040
#define _IOCPDC_IOCPDC6_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC7_POSITION                 0x00000007
#define _IOCPDC_IOCPDC7_MASK                     0x00000080
#define _IOCPDC_IOCPDC7_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC8_POSITION                 0x00000008
#define _IOCPDC_IOCPDC8_MASK                     0x00000100
#define _IOCPDC_IOCPDC8_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC9_POSITION                 0x00000009
#define _IOCPDC_IOCPDC9_MASK                     0x00000200
#define _IOCPDC_IOCPDC9_LENGTH                   0x00000001

